Repository: IBM/watson-translator-101
Catalog: en-fr-6000-ParallelCorpus.tmx
Source language: en
Languages: fr

source: 7.3 With regard to the author's contentions concerning the violation of her right to liberty and security of person, the Committee considers that her arrest and detention incommunicado for seven days and the restrictions on the exercise of the right of habeas corpus constitute violations of article 9 of the Covenant as a whole.
fr: 7.3 En ce qui concerne le grief de violation du droit à la liberté et à la sécurité de la personne, le Comité considère que l'arrestation, la détention au secret pendant sept jours et les restrictions à l'exercice du droit de recours en habeas corpus constituent des violations de l'article 9 du Pacte dans son ensemble.

source: 7.4 The author contends that the regime of deprivation of liberty applied to her under Decree-Law No. 25475 constitutes a violation of article 10 of the Covenant.
fr: 7.4 L'auteur allègue que le régime de privation de liberté qui lui a été appliqué sur la base du décret-loi no 25475 constitue une violation de l'article 10 du Pacte.

source: The Committee considers that the conditions of detention in the Chorrillos Women's Maximum Security Prison described by the author, particularly those applied during her first year of detention, violated her right to be treated with humanity and with respect for the inherent dignity of her person and therefore breached the provisions of article 10 as a whole.
fr: Le Comité considère que les conditions de détention auxquelles elle a été soumise dans le pénitencier de haute sécurité de Chorrillos décrites par l'auteur, en particulier pendant la première année de détention, constituent une violation du droit d'être traitée avec humanité et avec le respect de la dignité inhérente à l'être humain, et contreviennent donc aux dispositions de l'article 10 dans son ensemble.

source: 7.5 With regard to the author's complaints in relation to article 14, the Committee takes note of her allegations that the hearings at her trial were held in private and that the court comprised faceless judges who could not be challenged; that she was unable to communicate with her lawyer during the seven days she was held incommunicado; that the police officers involved in the investigation were not called as witnesses since this was not permitted under Decree-Law No. 25475; and that her lawyer was not able to challenge witnesses who had made statements during the police investigation.
fr: 7.5 Pour ce qui est des griefs de violation de l'article 14 du Pacte, le Comité prend note des allégations de l'auteur qui explique que son procès s'est déroulé à huis clos et que le tribunal était composé de «juges sans visage» qu'il était impossible de récuser, qu'elle n'a pas pu communiquer avec son avocat pendant les sept jours où elle est restée au secret, que les policiers chargés de l'enquête n'ont pas été appelés à déposer en qualité de témoins vu que le décret-loi no 25475 ne le permettait pas, et que son avocat n'a pas eu la possibilité d'interroger les témoins qui avaient fait une déclaration à la police au stade de l'enquête.

source: In the circumstances, the Committee concludes that article 14 of the Covenant, which refers to the right to a fair trial, was breached as a whole.
fr: Dans les circonstances de l'espèce, le Comité conclut qu'il y a eu violation de l'article 14 du Pacte, qui consacre le droit d'être jugé avec toutes les garanties d'une procédure régulière, pris dans son ensemble.

source: The Human Rights Committee, acting under article 5, paragraph 4, of the Optional Protocol to the International Covenant on Civil and Political Rights, is of the view that the facts before it disclose a violation of articles 7, 9, 10 and 14, together with article 2, paragraph 1, of the Covenant.
fr: Le Comité des droits de l'homme, agissant en vertu du paragraphe 4 de l'article 5 du Protocole facultatif se rapportant au Pacte international relatif aux droits civils et politiques, estime que les faits dont il est saisi font apparaître une violation des articles 7, 9, 10 et 14, lus conjointement avec le paragraphe 1 de l'article 2 du Pacte.

source: In accordance with article 2, paragraph 3 (a), of the Covenant, the State party is required to furnish the author with an effective remedy and appropriate compensation.
fr: Conformément au paragraphe 3 a) de l'article 2 du Pacte, l'État partie est tenu d'assurer à l'auteur un recours utile et une indemnisation appropriée.

source: In the light of the long period she has already spent in detention and the nature of the acts of which she stands accused, the State party should give serious consideration to terminating her deprivation of liberty, pending the outcome of the current proceedings.
fr: Étant donné que l'auteur a passé de longues années en détention et vu la nature des faits dont elle est accusée, l'État partie devrait envisager la possibilité de mettre fin à sa détention, en attendant l'issue du procès actuellement en cours.

source: Bearing in mind that, as a party to the Optional Protocol, the State party recognizes the competence of the Committee to determine whether there has been a violation of the Covenant, and that, under article 2 of the Covenant, the State party has undertaken to ensure to all individuals within its territory and subject to its jurisdiction the rights recognized in the Covenant and to offer an effective and enforceable remedy when a violation is found to have occurred, the Committee wishes to receive from the State party, within 90 days, information about the measures taken to give effect to the present Views.
fr: Étant donné qu'en adhérant au Protocole facultatif l'État partie a reconnu que le Comité avait compétence pour déterminer s'il y a eu ou non violation du Pacte et que, conformément à l'article 2 du Pacte, il s'est engagé à garantir à tous les individus se trouvant sur son territoire et relevant de sa juridiction les droits reconnus dans le Pacte et à assurer un recours utile et exécutoire lorsqu'une violation a été établie, le Comité souhaite recevoir de l'État partie, dans un délai de 90 jours, des renseignements sur les mesures prises pour donner effet à ses constatations.

source: Subsequently to be issued also in Arabic, Chinese and Russian as part of the Committee's annual report to the General Assembly.
fr: Paraîtra ultérieurement en arabe, en chinois et en russe dans le rapport annuel du Comité à l'Assemblée générale.

source: * The following members of the Committee participated in the examination of the present communication: Mr. Prafullachandra Natwarlal Bhagwati, Mr. Alfredo Castillero Hoyos, Ms. Christine Chanet, Mr. Maurice Glèlè Ahanhanzo, Mr. Walter Kälin, Mr. Ahmed Tawfik Khalil, Mr. Rajsoomer Lallah, Mr. Michael O'Flaherty, Ms. Elisabeth Palm, Mr. Rafael Rivas Posada, Sir Nigel Rodley, Mr. Ivan Shearer, Mr. Hipólito Solari-Yrigoyen, Ms. Ruth Wedgwood and Mr. Roman Wieruszewski.
fr: ** Les membres du Comité dont le nom suit ont participé à l'examen de la communication: M. Prafullachandra Natwarlal Bhagwati, M. Alfredo Castillero Hoyos, Mme Christine Chanet, M. Maurice Glèlè Ahanhanzo, M. Walter Kälin, M. Ahmed Tawfik Khalil, M. Rajsoomer Lallah, M. Michael O'Flaherty, Mme Elisabeth Palm, M. Rafael Rivas Posada, Sir Nigel Rodley, M. Ivan Shearer, M. Hipólito Solari-Yrigoyen, Mme Ruth Wedgwood et M. Roman Wieruszewski.

source: Article 13: “For the investigation and trial of the terrorist offences referred to in this Decree-Law the following rules shall be observed: (a) Once the charge has been formalized by the Public Prosecutor's Office, the detainees shall be brought before the criminal judge, who shall give the order to commence investigation with an arrest warrant within a period of 24 hours, after the necessary security measures have been taken.
fr: Article 13: «Aux fins de l'instruction et du jugement des affaires de terrorisme visées par le présent décret-loi, les règles ci-après sont d'application: a) suite à la réquisition du ministère public, le détenu est déféré devant le juge pénal, qui rend une décision d'ouverture de l'instruction avec ordre de mise en détention dans un délai de 24 heures en prévoyant les mesures de sécurité nécessaires.

source: During the investigation no form of release may be envisaged; there shall be no exceptions. (…) (d) On conclusion of the investigation, the file shall be transmitted to the President of the court in question, who shall transmit the proceedings to the chief prosecutor, who in turn shall appoint the senior prosecutor who must draw up the indictment within three days, being liable for failure to do so.”
fr: Au cours de l'instruction, aucune forme de liberté n'est admise… d) à la fin de l'instruction, le dossier est transmis au président du tribunal compétent, qui le transmet à son tour au doyen des procureurs, lequel désigne le Procureur supérieur qui doit formuler l'accusation dans un délai de trois jours, sous sa responsabilité.».

source: The communication was transmitted to the State party on 14 October 2002. The State party had six months, i.e. until 14 April 2003, to give its reply on admissibility and merits.
fr: La communication a été transmise le 14 octobre 2002 à l'État partie, qui disposait de six mois, soit jusqu'au 14 avril 2003, pour répondre sur la recevabilité et sur le fond.

source: When no reply was received, reminders were sent on 15 September and 18 November 2004.
fr: Aucune réponse n'ayant été reçue, des rappels lui ont été adressés en date du 15 septembre et du 18 novembre 2004.

source: The Office for National Statistics (ONS) is currently undertaking a major modernization programme that looks at the business processes and procedures, and the underlying technology solutions.
fr: L'Office for National Statistics (ONS) mène actuellement un vaste programme de modernisation de ses processus et procédures internes et des solutions technologiques sur lesquelles ceux-ci reposent.

source: This paper summarizes the challenges and implications for the Information Management Group (IMG) as it strives to deliver its part of the modernization agenda.
fr: Dans le présent document sont résumées les difficultés et les incidences auxquelles est confronté le Groupe de la gestion de l'information dans le cadre des efforts qu'il déploie pour assurer sa part de la modernisation.

source: It also looks at the steps IMG is taking to face up to those challenges.
fr: Le document décrit également les mesures prises par le Groupe pour y faire face.

source: IMG has a number of major challenges to address if it is to succeed in delivering its elements of the ONS modernization agenda:
fr: Le Groupe de la gestion de l'information doit surmonter un certain nombre de difficultés pour parvenir à exécuter sa part du programme de modernisation de l'ONS:

source: ONS has myriad disparate legacy systems that are difficult and costly to support.
fr: L'ONS dispose d'une multitude de systèmes anciens (systèmes patrimoniaux) disparates dont le maintien en service est à la fois complexe et coûteux.

source: Part of the modernization programme is to develop new solutions based primarily on Java and Oracle technology that will reduce, and eventually nullify, reliance on legacy systems;
fr: Le programme de modernisation porte notamment sur l'élaboration de nouvelles solutions s'appuyant principalement sur les technologies Java et Oracle et qui permettront de réduire, voire d'éliminer, la dépendance vis-à-vis de ces systèmes hérités du passé; Tout en s'adaptant aux exigences du programme de modernisation, le Groupe de la gestion de l'information doit faire en sorte que le travail courant continue de s'effectuer dans les meilleures conditions et que les statistiques continuent à être produites suivant le calendrier établi; Ces dernières années, le Groupe de la gestion de l'information a largement pâti du manque d'investissements dans les nouvelles technologies et ne dispose donc pas de la capacité interne qui lui permettrait de mener à bien le programme de modernisation sans appui extérieur; L'absence d'investissements a également des répercussions sur les normes, les procédures, les instruments et les techniques requises pour mettre en œuvre les nouvelles technologies; Le volume du travail à entreprendre au cours des trois années à venir dépasse sensiblement les capacités actuelles.

source: While delivering against the modernization agenda, IMG needs to ensure that business as usual is maintained to the highest standards and the outputs of the office are still produced according to agreed schedules; IMG has suffered significantly in recent years from a lack of investment in new technology and therefore does not have the internal capacity to undertake the modernization programme without support; The lack of investment also impacts on standards, procedures, tools and techniques necessary to deliver in the new technologies; The volume of work required over the next three years significantly exceeds current capacity.
fr: MESURES PRISES POUR SURMONTER CES DIFFICULTÉS

source: A. Resourcing
fr: Mobilisation de nouvelles ressources

source: IMG acknowledges that a significant amount of training and mentoring must accompany the introduction of new technologies.
fr: Le Groupe de la gestion de l'information reconnaît que l'introduction des nouvelles technologies doit s'accompagner d'un effort important de formation et d'encadrement.

source: Given the lack of investment to date, it was accepted that it would be some time before IMG's own staff were proficient and fully productive in the new development environment.
fr: Compte tenu du manque d'investissements observé jusqu'à présent, nul ne doute qu'il faudra un certain temps avant que le personnel du Groupe de la gestion de l'information soit totalement familiarisé avec les nouvelles techniques et pleinement productif dans le nouvel environnement de développement.

source: The skills deficit was compounded by the volume of work to be undertaken.
fr: Le manque de qualifications est exacerbé par le volume de travail à réaliser.

source: Estimates of the planned workload identified that IMG would need to double its development resource in order to meet demand.
fr: Des estimations de la charge de travail ont montré que le Groupe devrait doubler les ressources qu'il consacre au développement pour faire face à la demande.

source: With the lack of skills and resources, IMG decided the most appropriate option was to enter into a partnership arrangement with an external services company.
fr: Devant ce manque de qualifications et de moyens, le Groupe de la gestion de l'information a décidé que la meilleure solution était de conclure un accord de partenariat avec une entreprise de services extérieure.

source: Following a formal selection exercise, Xansa was chosen as the development partner.
fr: Au terme d'un processus de sélection en bonne et due forme, Xansa a été retenu comme partenaire de développement.

source: As expected, it took some time for the partnership to `bed in', with the inevitable uncertainty and scepticism from both sides at the outset.
fr: Comme prévu, il a fallu un certain temps avant que le partenariat s'installe véritablement, et que se dissipent les craintes et le scepticisme initiaux inévitables de part et d'autre.

source: Now the relationship is yielding benefits and further improvement can still be made.
fr: Aujourd'hui, les rapports sont fructueux, même si des améliorations sont encore possibles.

source: IMG expects up-skill its own staff in the new technologies. However, this brings a number of issues that are still being considered:
fr: Le Groupe de la gestion de l'information souhaite améliorer les compétences de son personnel dans le domaine des nouvelles technologies, mais il doit encore, pour ce faire, résoudre un certain nombre de problèmes:

source: Staff IMG wishes to train in new technologies are managing the business-as-usual work and cannot therefore be released without negatively impacting daily production activities; Unless IMG releases staff for training, it will remain overly reliant on its development partner, Xansa; Not all staff manage to make the transition from legacy to the Java/Oracle environment.
fr: Le personnel que le Groupe souhaite former aux nouvelles technologies doit continuer à assurer le travail courant et ne peut donc pas être déchargé de cette obligation pour suivre une formation sans que la production quotidienne de statistiques s'en ressente; Tant que le Groupe ne libèrera pas de ses tâches courantes le personnel qu'il souhaite former, il restera extrêmement dépendant de son partenaire, l'entreprise Xansa; Les membres du personnel ne sont pas tous à même de passer des systèmes anciens aux technologies Java/Oracle.

source: Standards, Techniques, Tools
fr: Normes, techniques et instruments

source: It was recognized that in order to deliver in the timescales required and to an agreed and repeatable standard, a significant amount of work needed to be done to establish a development framework.
fr: Il a été reconnu que pour fournir les services dans les temps, selon les normes de qualité convenues et, ce, de façon répétée, un important travail de développement était nécessaire.

source: From a start point of no agreed development life cycle, standards or tools, IMG has implemented the following:
fr: Alors qu'il n'existait aucun cycle de vie prédéfini de développement, aucune norme ni aucun instrument, le Groupe de la gestion de l'information a mis en place les éléments suivants:

source: A full life-cycle methodology, called ONSide, based on the framework provided by Xansa but amended to include ONS-specific requirements; The concept of Object Oriented Analysis and Design supported by the introduction of the Rational toolset, RUP (Rational Unified Process) and DSDM (Dynamic Systems Development Method); Component-based development; Creation of standard estimating and testing processes, using TASSC and KARNER estimating tools and the testing elements of the Rational toolset; Tailored training for development staff to support introduction of the above.
fr: Une méthode du cycle de vie dans sa totalité, baptisée ONSide, qui repose sur le cadre fourni par Xansa, mais adapté pour y intégrer les besoins propres à l'ONS; Un système d'analyse et de conception orientées objet, appuyé par l'introduction de la boîte à outils Rational, RUP (Rational Unified Process), et de la méthode DSDM (Dynamic Systems Development Method); Un développement à base de composants; Des processus normalisés d'estimation et de test, qui ont été créés en faisant appel aux instruments d'estimation TASSC et KARNER et aux instruments de test compris dans la boîte à outils Rational; Une formation adaptée du personnel requis pour assurer l'introduction des éléments précités.

source: The amount of time required for staff to become familiar in the new techniques has taken longer than originally anticipated, which obviously has impact on delivery against schedule.
fr: Il a fallu plus de temps que prévu au personnel pour se familiariser avec les nouvelles techniques, ce qui a retardé d'autant la production.

source: The estimating approach is therefore being updated to reflect this.
fr: Le processus d'estimation est donc actualisé pour tenir compte de cette réalité.

source: Although IMG staff welcomed the rigour that the introduction of the new life-cycle and supporting tools provided, the business users remained to be convinced that this new approach would yield benefits.
fr: Si le personnel du Groupe de la gestion de l'information avait, pour sa part, accueilli favorablement la rigueur apportée par l'introduction de la méthode du cycle de vie et des instruments d'appui, il restait à convaincre les utilisateurs appartenant au secteur économique des avantages du nouveau système.

source: However, after experiencing project delays - and enjoying a period of reflection - the business users are now embracing the life cycle and are requesting it be extended to cover some of their activities.
fr: Toutefois, après avoir connu des retards et au terme d'un délai de réflexion, ces utilisateurs adhèrent peu à peu à la méthode du cycle de vie et réclament son extension à certaines de leurs activités.

source: C. Organisation
fr: Organisation

source: With the provision of additional resources and the introduction of the development life cycle, it became apparent IMG was not organised as efficiently as it could be.
fr: Malgré les moyens supplémentaires mis en œuvre et l'introduction du cycle de vie de développement, il est devenu évident que le mode d'organisation du Groupe de la gestion de l'information manquait d'efficacité.

source: The most notable deficiency was lack of an overall design authority and technical architecture team, which was subsequently created and staffed with Xansa people, with a plan to migrate IMG staff into the team over time.
fr: La principale lacune résidait dans l'absence d'une équipe en charge de l'ensemble du travail de conception et de l'architecture technique. Cette structure a donc été constituée avec des effectifs de Xansa, avec pour objectif d'y intégrer par la suite des membres du personnel du Groupe.

source: A systems analysis and design function was also established as was the Java Technology Unit.
fr: Une fonction d'analyse et de conception de systèmes a également été créée, de même qu'une Unité de la technologie Java.

source: The estimating and testing functions were established as virtual teams with staff trained in techniques and used appropriately.
fr: Les fonctions d'estimation et de test ont été déléguées à des équipes virtuelles constituées d'un personnel formé aux techniques correspondantes et intervenant selon les besoins.

source: External Influencers
fr: Facteurs externes

source: The steps noted above are major undertakings in their own right.
fr: Les mesures susmentionnées sont en elles-mêmes des actions de grande ampleur.

source: However, ONS is required to make significant changes to fall in line with Government initiatives and reviews such as Gershon, Lyons and Allsopp.
fr: Cependant, l'ONS doit encore procéder à des changements importants pour se conformer aux initiatives arrêtées par le Gouvernement et aux conclusions des études qu'il a commanditées, telles que les études Gershon, Lyons et Allsopp.

source: These reviews can significantly impact on the modernization agenda.
fr: Ces études peuvent avoir un effet significatif sur le programme de modernisation.

source: As a result, IMG needs to undertake a number of tactical pieces of work while maintaining the drive to deliver against the strategic vision.
fr: Aussi, le Groupe de la gestion de l'information doit-il entreprendre un certain nombre de tâches tactiques tout en continuant à fournir les services attendus suivant la vision stratégique de l'ONS.

source: Achieving permanence with accountability
fr: Faire valoir le principe de responsabilité permanente

source: Realizing fully the purposes and objectives of the Treaty on the Non-Proliferation of Nuclear Weapons requires a commitment by all States parties to effect full implementation and ensure the Treaty's overall authority.
fr: Afin que les buts et objectifs du Traité sur la non-prolifération des armes nucléaires soient pleinement réalisés, tous les États parties doivent s'engager à mettre intégralement en œuvre ce traité et à en garantir l'autorité.

source: Achieving permanence with accountability, the concept that underlay the indefinite extension of the treaty, is also a key goal.
fr: Il est en outre primordial de faire valoir le principe de responsabilité permanente, concept qui est à la base de la prorogation du Traité pour une durée indéfinie.
